---
kind: property
id: P:Autodesk.Revit.DB.PanelTypeSet.IsEmpty
source: html/ef4b56b2-fe09-9ae9-20ce-7a07d97c6e00.htm
---
# Autodesk.Revit.DB.PanelTypeSet.IsEmpty Property

Test to see if the set is empty.

## Syntax (C#)
```csharp
public virtual bool IsEmpty { get; }
```

## Remarks
If the set is empty then True will be returned, otherwise False.